Revit 2026 API

# DataConversionMonitorScope Constructor

---

The only constructor. Expects a valid pointer to IDataConversionMonitor.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DataConversionMonitorScope(
	IDataConversionMonitor IDCM
)
```
```vb
Public Sub New (
	IDCM As IDataConversionMonitor
)
```
```cpp
public:
DataConversionMonitorScope(
	IDataConversionMonitor^ IDCM
)
```
```fsharp
new :
        IDCM : IDataConversionMonitor -> DataConversionMonitorScope
```

#### Parameters

IDCM IDataConversionMonitor

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DataConversionMonitorScope Class

Autodesk.Revit.DB Namespace